from flask import Flask, jsonify
import random
import os

app = Flask(__name__)

# Sample Nepali jokes

jokes = [
  "कक्षामा शिक्षकले एक दिन विद्यार्थीहरुलाई एउटा पेज दिएर आफ्नो प्रेमी, प्रेमिकाको नाम लेख्न लगाएछन... एउटा छात्र बाहेक सबैले दुई सेकेण्डमा नै नाम लेखेर सरलाई बुझाएछन् ..दश मिनेटपछि त्यो छात्राले उठेर : सर...! थप कपी...दिनुहोश न",
  "शिक्षक : चोरिको फल एकदम नराम्रो हुन्छ त्यसैले कहिले पनि चोरी नगर्नुरामले बिचमै उठेर भन्यो तर सर हिजो मैले एउटा स्याउ चोरेर खाएको थिए त्यो त एकदम मिठो थियो त ।",
  "गिलास उल्टो समात्दै कालेः होइन यो गिलास को मुर्खले बनाको यसमा पानी कसरी राख्ने हो अनि जसो तसो राखीहाल्यो भने पनि तलतिर खुल्लै छ,कसरी अडिन्छ पानी ।"
]

@app.route('/joke', methods=['GET'])
def get_joke():
  joke = random.choice(jokes)
  return jsonify({'joke': joke})

if __name__ == '__main__':
    port = int(os.environ.get('PORT', 5000))
    app.run(host='0.0.0.0', port=port)